---
kind: method
id: M:Autodesk.Revit.DB.View3D.CanResetCameraTarget
zh: 三维视图、3d视图
source: html/623690f7-1877-f311-bbd3-30ec1ea1fc28.htm
---
# Autodesk.Revit.DB.View3D.CanResetCameraTarget Method

**中文**: 三维视图、3d视图

Checks whether the camera target can be reset for this view.

## Syntax (C#)
```csharp
public bool CanResetCameraTarget()
```

## Returns
True if camera target can be reset for this view, false otherwise.

## Remarks
The camera target can only be reset for perspective view.